{"artists":[{"idArtist":"114777","strArtist":"Capleton","strArtistStripped":null,"strArtistAlternate":"","strLabel":null,"idLabel":null,"intFormedYear":"1967","intBornYear":"1967","intDiedYear":null,"strDisbanded":null,"strStyle":"","strGenre":"","strMood":"","strWebsite":"","strFacebook":"","strTwitter":"1","strBiographyEN":"Capleton (born Clifton George Bailey III, 13 April 1967, Saint Mary, Jamaica) is a Jamaican reggae and dancehall artist. He is also referred to as King Shango, King David, The Fireman and The Prophet. His record label is called David House Productions. He is known for his Rastafari movement views expressed in his songs. Bailey was born in Islington in St. Mary in 1967. As a youth, he was given the surname of a popular St. Mary lawyer and friend of the family, Capleton, as a nickname by his relatives and friends. Capleton rejects the name given to him at birth, given its European origin. He now prefers \"King Shango\", given its roots in the Yoruba language. As a teenager, he snuck out of his home to catch local dancehall acts, eventually leaving St. Mary for Kingston at the age of 18 to work on his career as a dancehall deejay.\n","strBiographyDE":null,"strBiographyFR":"Capleton (né Clifton George Bailey III, le 13 avril 1967 à Saint Mary, Jamaïque) est un artiste jamaïcain de reggae et de dancehall. Il est également appelé le roi Shango, le roi David, le pompier et le prophète. Son label s'appelle David House Productions. Il est connu pour ses opinions sur le mouvement Rastafari exprimées dans ses chansons. Bailey est né à Islington à St. Mary en 1967. Dans sa jeunesse, il a reçu le nom de famille d'un avocat populaire de St. Mary et ami de la famille, Capleton, comme surnom de ses parents et amis. Capleton rejette le nom qui lui a été donné à la naissance, compte tenu de son origine européenne. Il préfère désormais \"King Shango\", compte tenu de ses racines dans la langue yoruba. Adolescent, il s'est faufilé hors de chez lui pour assister à des numéros de dancehall locaux, quittant finalement St. Mary pour Kingston à l'âge de 18 ans pour travailler sur sa carrière de DJ de dancehall. ","strBiographyCN":null,"strBiographyIT":null,"strBiographyJP":null,"strBiographyRU":null,"strBiographyES":null,"strBiographyPT":null,"strBiographySE":null,"strBiographyNL":null,"strBiographyHU":null,"strBiographyNO":null,"strBiographyIL":null,"strBiographyPL":null,"strGender":"","intMembers":"1","strCountry":"","strCountryCode":"JM","strArtistThumb":"https://www.theaudiodb.com/images/media/artist/thumb/yyqxyw1359465655.jpg","strArtistLogo":null,"strArtistCutout":null,"strArtistClearart":null,"strArtistWideThumb":null,"strArtistFanart":"https://www.theaudiodb.com/images/media/artist/fanart/sssqpr1445894811.jpg","strArtistFanart2":null,"strArtistFanart3":null,"strArtistFanart4":null,"strArtistBanner":null,"strMusicBrainzID":"93dda03d-c1d3-42c2-80b0-fa71bc20262b","strISNIcode":null,"strLastFMChart":null,"intCharted":"4","strLocked":"unlocked"}]}