{"artists":[{"idArtist":"121465","strArtist":"GZA/Genius","strArtistStripped":null,"strArtistAlternate":"Genius","strLabel":null,"idLabel":null,"intFormedYear":"1989","intBornYear":"1966","intDiedYear":null,"strDisbanded":null,"strStyle":"Urban/R&B","strGenre":"Hip-Hop","strMood":"","strWebsite":"","strFacebook":"","strTwitter":"1","strBiographyEN":"The Genius, aka the GZA, was the most cerebral MC in the Wu-Tang Clan, as well as perhaps the most acclaimed. His cool, precise flow and intricate, literate rhymes weren't as theatrical as Method Man or Ol' Dirty Bastard, the two biggest commercial stars to spring from the collective. But among hip-hop aficionados, The Genius was revered for his flawless technique and lyrical dexterity, and was considered by many to be the best pure rapper in the entire Clan. The Genius was born Gary Grice on August 22, 1966, in Staten Island, NY, and shuttled between several other New York boroughs with various relatives during his childhood. He started learning rhymes by the earliest hip-hop MCs while spending time in the Bronx, and returned to Staten Island to share them with his cousins, who later became Ol' Dirty Bastard and the RZA. In fact, the three of them first teamed up in the early '80s as part of an obscure group called All in Together Now.\n\nTime passed, and The Genius landed a recording contract with Cold Chillin', which, unfortunately, was nearing the end of its brilliant run. In 1991, he became the only future Wu-Tang member to release a solo album prior to the Clan's formation, with Words From the Genius. Produced mostly by Easy Mo Bee, the album flopped badly and, creatively, did little to hint at The Genius' future standing. Conflicts with the label sent The Genius packing, and he reteamed with a similarly disenchanted RZA (fresh off a failed stint with Tommy Boy) and Ol' Dirty Bastard to co-found the Wu-Tang Clan. Adding six other friends and associates, the group became an underground sensation and took the rap world by storm with its 1993 debut, Enter the Wu-Tang (36 Chambers). Their innovative contract allowed each member to sign a solo deal with whatever label they chose, and The Genius wound up on Geffen. In 1994, his first post-Wu solo track, \"I Gotcha Back,\" appeared on the soundtrack of the film Fresh. His second solo album, Liquid Swords, followed in 1995 and was hailed as a hip-hop classic thanks to its coolly understated menace. While it didn't make him a star on the level of Method Man, the album did sell well, reaching the pop Top Ten and falling one spot short of the top of the R&B charts. There were no big mainstream hits, but the title cut, \"Cold World,\" and \"Shadowboxin'\" all did well on the rap charts.\n\nFollowing the Clan's 1997 sophomore set, Wu-Tang Forever, The Genius returned to the solo arena with 1999's Beneath the Surface. While critics didn't praise it quite as lavishly as Liquid Swords, it was another well-received effort (especially compared to some of the lackluster follow-ups elsewhere in the Wu-Tang camp), and it topped the R&B album charts. After reconvening with the Wu for 2000's The W and 2001's Iron Flag, The Genius dropped his fourth solo effort, Legend of the Liquid Sword, in late 2002, consolidating his reputation as one of the most skillful rappers around. Grandmasters, a collaborative project between himself and Cypress Hill DJ Muggs was released in 2005, followed the next year by an instrumental version and then a remix version in 2007. A year later GZA released the solo album Pro Tools on the indie label Babygrande. It featured guest shots from Wu affiliates RZA, Masta Killa, and producer Mathematics.","strBiographyDE":null,"strBiographyFR":null,"strBiographyCN":null,"strBiographyIT":null,"strBiographyJP":null,"strBiographyRU":null,"strBiographyES":null,"strBiographyPT":null,"strBiographySE":null,"strBiographyNL":null,"strBiographyHU":null,"strBiographyNO":null,"strBiographyIL":null,"strBiographyPL":null,"strGender":"Male","intMembers":"1","strCountry":"Brooklyn, NY, USA","strCountryCode":"US","strArtistThumb":"https://www.theaudiodb.com/images/media/artist/thumb/gzagenius-5051f415960e0.jpg","strArtistLogo":"https://www.theaudiodb.com/images/media/artist/logo/gzagenius-4fe71124ba73c.png","strArtistCutout":null,"strArtistClearart":null,"strArtistWideThumb":null,"strArtistFanart":"https://www.theaudiodb.com/images/media/artist/fanart/gzagenius-4dda693c8d7b5.jpg","strArtistFanart2":"https://www.theaudiodb.com/images/media/artist/fanart/gzagenius-55ceebf192402.jpg","strArtistFanart3":"https://www.theaudiodb.com/images/media/artist/fanart/gzagenius-55ceea1e6a5b1.jpg","strArtistFanart4":"https://www.theaudiodb.com/images/media/artist/fanart/gzagenius-4dda693c8d7b5.jpg","strArtistBanner":"https://www.theaudiodb.com/images/media/artist/banner/gzagenius-55cf0a4ace8af.jpg","strMusicBrainzID":"550cb78b-4995-4873-baea-76ef265531f5","strISNIcode":null,"strLastFMChart":null,"intCharted":"3","strLocked":"unlocked"}]}