{"artists":[{"idArtist":"112442","strArtist":"The Notorious B.I.G.","strArtistStripped":null,"strArtistAlternate":"Biggie Smalls","strLabel":null,"idLabel":null,"intFormedYear":"1992","intBornYear":"1972","intDiedYear":"1997","strDisbanded":null,"strStyle":"Urban/R&B","strGenre":"Hip-Hop","strMood":"Party","strWebsite":"","strFacebook":"","strTwitter":"1","strBiographyEN":"Christopher George Latore Wallace (May 21, 1972 - March 9, 1997), best known as The Notorious B.I.G., was an American rapper. He was also known as Biggie Smalls (after a character in the 1975 film Let's Do It Again) and Frank White (after the main character of the 1990 film King of New York).\nWallace was raised in the Brooklyn borough of New York City. When Wallace released his debut album Ready to Die in 1994, he became a central figure in the East Coast hip-hop scene and increased New York's visibility at a time when West Coast artists were more common in the mainstream. The following year, Wallace led his childhood friends to chart success through his protégé group, Junior M.A.F.I.A. While recording his second album, Wallace was heavily involved in the East Coast/West Coast hip-hop feud, dominating the scene at the time.\nOn March 9, 1997, Wallace was killed by an unknown assailant in a drive-by shooting in Los Angeles. His double-disc set Life After Death, released 15 days later, hit #1 on the U.S. album charts and was certified Diamond in 2000 (one of the few hip hop albums to receive this certification). Wallace was noted for his \"loose, easy flow\", dark semi-autobiographical lyrics and storytelling abilities. Since his death, a further two albums have been released. MTV ranked him at #3 on their list of The Greatest MCs of All Time. He has certified sales of 17 million units in the United States.","strBiographyDE":null,"strBiographyFR":"Christopher George Latore Wallace (21 mai 1972 - 9 mars 1997), mieux connu sous le nom de The Notorious B.I.G., était un rappeur américain. Il était également connu sous le nom de Biggie Smalls (d'après un personnage du film Let's Do It Again de 1975) et Frank White (d'après le personnage principal du film de 1990 King of New York).\nWallace a grandi dans le quartier de Brooklyn à New York. Lorsque Wallace a sorti son premier album Ready to Die en 1994, il est devenu une figure centrale de la scène hip-hop de la côte Est et a accru la visibilité de New York à une époque où les artistes de la côte ouest étaient plus courants dans le courant dominant. L'année suivante, Wallace a conduit ses amis d'enfance à connaître le succès grâce à son groupe de protégés, Junior M.A.F.I.A. Lors de l'enregistrement de son deuxième album, Wallace a été fortement impliqué dans la querelle hip-hop côte est / côte ouest, dominant la scène à l'époque.\nLe 9 mars 1997, Wallace a été tué par un agresseur inconnu lors d'une fusillade en voiture à Los Angeles. Son double disque Life After Death , sorti 15 jours plus tard, a atteint la première place des charts américains et a été certifié Diamant en 2000 (l'un des rares albums hip hop à recevoir cette certification). Wallace était connu pour son \"flux lâche et facile\", ses paroles semi-autobiographiques sombres et ses capacités de narration. Depuis sa mort, deux autres albums sont sortis. MTV l'a classé n ° 3 sur leur liste des plus grands MC de tous les temps. Il a certifié des ventes de 17 millions d'unités aux États-Unis.","strBiographyCN":null,"strBiographyIT":null,"strBiographyJP":null,"strBiographyRU":null,"strBiographyES":"Christopher George Latore Wallace (21 de mayo de 1972 - 9 de marzo de 1997), mejor conocido como The Notorious B.I.G., fue un rapero estadounidense. También era conocido como Biggie Smalls (por un personaje de la película Let's Do It Again de 1975) y Frank White (por el personaje principal de la película de 1990 King of New York).\nWallace se crió en el distrito de Brooklyn de la ciudad de Nueva York. Cuando Wallace lanzó su álbum debut Ready to Die en 1994, se convirtió en una figura central en la escena del hip-hop de la costa este y aumentó la visibilidad de Nueva York en un momento en que los artistas de la costa oeste eran más comunes en la corriente principal. Al año siguiente, Wallace llevó a sus amigos de la infancia a trazar el éxito a través de su grupo protegido, Junior M.A.F.I.A. Mientras grababa su segundo álbum, Wallace estuvo muy involucrado en la disputa de hip-hop de la costa este / oeste, dominando la escena en ese momento.\nEl 9 de marzo de 1997, Wallace fue asesinado por un asaltante desconocido en un tiroteo desde un vehículo en Los Ángeles. Su disco doble Life After Death, lanzado 15 días después, alcanzó el número 1 en las listas de álbumes de Estados Unidos y fue certificado como Diamante en 2000 (uno de los pocos álbumes de hip hop en recibir esta certificación). Wallace se destacó por su \"fluidez suelta, fluida\", letras oscuras semi-autobiográficas y habilidades para contar historias. Desde su muerte, se han lanzado otros dos álbumes. MTV lo ubicó en el puesto número 3 en su lista de los mejores MCs de todos los tiempos. Tiene ventas certificadas de 17 millones de unidades en Estados Unidos.","strBiographyPT":null,"strBiographySE":null,"strBiographyNL":null,"strBiographyHU":null,"strBiographyNO":null,"strBiographyIL":null,"strBiographyPL":null,"strGender":"Male","intMembers":"1","strCountry":"Brooklyn, New York","strCountryCode":"US","strArtistThumb":"https://www.theaudiodb.com/images/media/artist/thumb/notorious-big-the-5001dfaea76fa.jpg","strArtistLogo":"https://www.theaudiodb.com/images/media/artist/logo/xqvsvs1492540218.png","strArtistCutout":null,"strArtistClearart":"https://www.theaudiodb.com/images/media/artist/clearart/suppwv1511278312.png","strArtistWideThumb":"https://www.theaudiodb.com/images/media/artist/widethumb/vsuwwu1524832311.jpg","strArtistFanart":"https://www.theaudiodb.com/images/media/artist/fanart/xpypxu1424226744.jpg","strArtistFanart2":"https://www.theaudiodb.com/images/media/artist/fanart/vuysqs1492540313.jpg","strArtistFanart3":"https://www.theaudiodb.com/images/media/artist/fanart/upvxwx1367226944.jpg","strArtistFanart4":"https://www.theaudiodb.com/images/media/artist/fanart/paop1q1614939340.jpg","strArtistBanner":"https://www.theaudiodb.com/images/media/artist/banner/uxsrvq1367226975.jpg","strMusicBrainzID":"d5d97b2b-b83b-4976-814a-056d9076c8c3","strISNIcode":null,"strLastFMChart":null,"intCharted":"4","strLocked":"unlocked"}]}