{"artists":[{"idArtist":"115228","strArtist":"RZA","strArtistStripped":null,"strArtistAlternate":"","strLabel":null,"idLabel":null,"intFormedYear":"1969","intBornYear":"1969","intDiedYear":null,"strDisbanded":null,"strStyle":"Urban/R&B","strGenre":"Hip-Hop","strMood":"","strWebsite":"","strFacebook":"","strTwitter":"1","strBiographyEN":"Robert Fitzgerald Diggs (born July 5, 1969), better known by his stage name RZA (pron.: /ˈrɪzə/ RIZ-ə; usually styled RZA), is an American Grammy-winning music producer, multi-instrumentalist, author, MC, and occasional actor, director, and screenwriter. A prominent figure in hip hop, RZA is the de facto leader of the Wu-Tang Clan. He has produced almost all of Wu-Tang Clan's albums as well as many Wu-Tang solo and affiliate projects. He has also released solo albums under the alter-ego Bobby Digital, along with executive producing credits for side projects. In addition to the Wu-Tang Clan and his solo releases, RZA was also a founding member of the horrorcore Hip Hop group Gravediggaz where he used the name The RZArector. Furthermore, he has acted in several movies, including Coffee and Cigarettes, American Gangster, Gospel Hill, Life Is Hot in Cracktown, Ghost Dog, Funny People, Derailed, Due Date and Repo Men. He also appears in the Showtime TV series Californication. His directorial debut is for the film he co-wrote and in which he plays the title role, The Man with the Iron Fists, starring Russell Crowe. On November 1, 2012, he introduced the movie at a preview screening in the Museum of the Moving Image in Astoria, Queens, the evening before the Universal picture opened nationwide.\n\nIn 2008, Rza was ranked #4 on About.com's list of the Top 50 Hip-Hop Producers, while The Source placed him on its list of the 20 greatest producers in the magazine's twenty-year history. He also made the \"Elite 8\" in the search for The Greatest Hip-Hop Producer of All Time by Vibe.","strBiographyDE":null,"strBiographyFR":"RZA, de son vrai nom Robert Fitzgerald Diggs, né le 5 juillet 1969 à Brooklyn, New York, est un rappeur, producteur, acteur et réalisateur américain, membre fondateur et leader de facto du groupe Wu-Tang Clan. Il participe à la production de presque tous les albums du Wu-Tang Clan, ainsi que des affiliés et membres du groupe.\n\nRZA est le cousin d'Ol' Dirty Bastard et de GZA. Il a publié des albums sous le nom de scène Bobby Digital. Hormis ses collaborations avec le Wu-Tang Clan et en parallèle à sa carrière solo, RZA est membre fondateur du groupe horrorcore Gravediggaz dans lequel il utilise le surnom de The RZArector. Il participe également au tournage de plusieurs films comme Coffee and Cigarettes, American Gangster, Gospel Hill, Life Is Hot in Cracktown, Ghost Dog : La Voie du samouraï, Funny People, Dérapage, Date limite et Repo Men. Il participe aussi à la série télévisée Californication. Il forme également le duo Banks & Steelz avec Paul Banks du groupe Interpol.\n\nLe magazine The Source le choisit dans sa liste des 20 meilleurs producteurs. Le New Musical Express (NME) le classe dans sa liste des 50 meilleurs producteurs de tous les temps. ","strBiographyCN":null,"strBiographyIT":null,"strBiographyJP":null,"strBiographyRU":null,"strBiographyES":null,"strBiographyPT":null,"strBiographySE":null,"strBiographyNL":null,"strBiographyHU":null,"strBiographyNO":null,"strBiographyIL":null,"strBiographyPL":null,"strGender":"","intMembers":"1","strCountry":"Staten Island, New York","strCountryCode":"US","strArtistThumb":"https://www.theaudiodb.com/images/media/artist/thumb/rza-5051ece0eadfa.jpg","strArtistLogo":"https://www.theaudiodb.com/images/media/artist/logo/rza-4fe7235eec64e.png","strArtistCutout":null,"strArtistClearart":null,"strArtistWideThumb":null,"strArtistFanart":"https://www.theaudiodb.com/images/media/artist/fanart/rza-4e062357b258f.jpg","strArtistFanart2":"https://www.theaudiodb.com/images/media/artist/fanart/rza-55dd9f997d9dc.jpg","strArtistFanart3":"https://www.theaudiodb.com/images/media/artist/fanart/rza-55dd9f997e0d3.jpg","strArtistFanart4":"https://www.theaudiodb.com/images/media/artist/fanart/rza-55dd9f997e941.jpg","strArtistBanner":"https://www.theaudiodb.com/images/media/artist/banner/rza-55e0060a2d32d.jpg","strMusicBrainzID":"29c28ac3-27c5-4822-8eb6-0af89a3a7240","strISNIcode":null,"strLastFMChart":null,"intCharted":"4","strLocked":"unlocked"}]}