{"artists":[{"idArtist":"127435","strArtist":"Cappadonna","strArtistStripped":null,"strArtistAlternate":"Cappachino","strLabel":null,"idLabel":null,"intFormedYear":"1995","intBornYear":"1969","intDiedYear":null,"strDisbanded":null,"strStyle":"Urban/R&B","strGenre":"Hip-Hop","strMood":"","strWebsite":"www.wutang-corp.com/artists/wu-artist.php?id=2","strFacebook":"www.facebook.com/pages/Cappadonna/6834907404‎","strTwitter":"1","strBiographyEN":"Darryl Hill (born September 18, 1969) best known by his stage name Cappadonna, is an American rapper and unofficial member of the hip-hop collective Wu-Tang Clan. He is also a member of rap group Theodore Unit with Ghostface Killah.\n\nCappadonna (also known as Cappachino) was a member of the early stages of what was to become the Wu-Tang Clan, with RZA, Ol' Dirty Bastard, Ghostface Killah, and Raekwon. However, Cappadonna went to prison and was replaced by Method Man.\nIn the 2010 documentary Wu-Tang Saga, Cappadonna stated that his name is an acronym: \"Consider All Poor People Acceptable Don't Oppress Nor Neglect Anyone.\"\nCappadonna made his recording debut as an affiliate of the Wu-Tang Clan on Raekwon's hit single \"Ice Cream\". He was also a guest star, along with Raekwon, on Ghostface Killah's solo debut album, Ironman. He made his first appearance on a Wu-Tang Clan album in 1997 on Wu-Tang Forever on the single \"Triumph\". \n\nFollowing his appearance on Forever, he contributed significantly to the group's third studio album, The W, at which point his appearances were no longer marked with \"Featuring Cappadonna\", as they had been on Forever. After a falling out with RZA the next year over royalties, he did not appear at all on the group's subsequent album Iron Flag. He eventually reunited with the group for their concert at 2004's Rock the Bells, and appeared on 2007's 8 Diagrams.\nCappadonna's status as a Wu-Tang member or as a featured artist has varied throughout the years. While long referred to by both the group and fans as the \"Unofficial Tenth Member\", there is no confirmation on whether he actually became the official tenth member following the death of Ol' Dirty Bastard. While MTV.com's biographies of both him and the group claim that he is an official member, their subsequent bios on the group's official website do not list him as such. Also, while his vocals on 8 Diagrams were not marked with \"Feat. Cappadonna\", much like The W, he does not appear on the front cover with the original eight living members, and is not featured in the album's booklet with a picture, although he is included in the group's shout-out's sections. \n\nCappadonna's first solo effort was 1998's The Pillage which debuted at #3 on the charts and certified Gold. His follow-up - 2001's “The Ying and The Yang” - met with similar critical and commercial success. Staying vigilant in his support of The Clan, he then featured on over 25 releases including classics from Raekwon, Method Man and Ghostface. \n\nKnown for his colorful wardrobe, he frequently refers to fashion designers and his large collection of boutique clothing in his raps.","strBiographyDE":null,"strBiographyFR":null,"strBiographyCN":null,"strBiographyIT":null,"strBiographyJP":null,"strBiographyRU":null,"strBiographyES":null,"strBiographyPT":null,"strBiographySE":null,"strBiographyNL":null,"strBiographyHU":null,"strBiographyNO":null,"strBiographyIL":null,"strBiographyPL":null,"strGender":"Male","intMembers":"1","strCountry":"Staten Island, New York","strCountryCode":"US","strArtistThumb":"https://www.theaudiodb.com/images/media/artist/thumb/sspurp1393970615.jpg","strArtistLogo":null,"strArtistCutout":null,"strArtistClearart":null,"strArtistWideThumb":null,"strArtistFanart":"https://www.theaudiodb.com/images/media/artist/fanart/stxpqv1393970628.jpg","strArtistFanart2":"https://www.theaudiodb.com/images/media/artist/fanart/uurrwy1393970643.jpg","strArtistFanart3":"https://www.theaudiodb.com/images/media/artist/fanart/qwxrup1393970660.jpg","strArtistFanart4":null,"strArtistBanner":"https://www.theaudiodb.com/images/media/artist/banner/ywpspy1393970673.jpg","strMusicBrainzID":"20292c32-1fe2-4e5d-82c8-7e04e6b8cf73","strISNIcode":null,"strLastFMChart":null,"intCharted":"3","strLocked":"unlocked"}]}