{"artists":[{"idArtist":"127438","strArtist":"Smif-n-Wessun","strArtistStripped":null,"strArtistAlternate":"","strLabel":null,"idLabel":null,"intFormedYear":"1993","intBornYear":"1993","intDiedYear":null,"strDisbanded":null,"strStyle":"Urban/R&B","strGenre":"Hip-Hop","strMood":"Angry","strWebsite":"","strFacebook":"","strTwitter":"1","strBiographyEN":"Smif-n-Wessun (aka Cocoa Brovaz) is a hip hop duo consisting of members Tek (Tekomin Williams) and Steele (Darrell Yates). Smif-n-Wessun comprise two-eighths of the Brownsville, Brooklyn supergroup Boot Camp Clik, with Buckshot, Heltah Skeltah and O.G.C. Both members are known for their Jamaican Patois during their raps, which was more evident during the earlier stages of their career. The duo debuted on Black Moon's 1993 album Enta da Stage, appearing on the tracks \"Black Smif-N-Wessun\" and \"U Da Man\". They released their first single \"Bucktown\" b/w \"Let's Git It On\" in early 1994. \"Bucktown\" became an underground smash, and gave the group considerable hype for their debut album, Dah Shinin', released in January 1995. The album debuted in the top 5 on the Top R&B/Hip-Hop Albums chart, and went on to sell over 300,000 copies in the United States. Along with \"Bucktown,\" the album featured the singles \"Wrekonize\" b/w \"Sound Bwoy Bureill\" and \"Wontime\" b/w \"Stand Strong.\" Dah Shinin became an influential album in the hardcore New York hip hop scene of the mid-1990s, and is considered a rap classic. Soon after the release of their debut, Smif-N-Wessun were sued with a cease and desist order over their group name by the Smith & Wesson firearms company. To avoid the lawsuit, they decided to change their name to the Cocoa Brovaz in 1996. In 1996, Smif-n-Wessun and the Boot Camp Clik flew to Los Angeles to record an album with Death Row Records artist, 2Pac. The album was titled \"One Nation.\" 2Pac planned to release it with two discs, one titled \"WestCoast\" and the other titled \"EastCoast.\" Fat Joe was supposed to fly to L.A. but never turned up. Snoop Dogg, Outlawz and others were also going to be featured on the album.\nIn 1997, the Cocoa B'z joined up with the entire Boot Camp Clik for their first group album For the People. The album was seen as a disappointment, and led to the eventual decline of the Camp's popularity. In early 1998, they dropped their second album The Rude Awakening. The release was met with mixed reviews and moderate sales. The album's lead single, the Raekwon-assisted \"Black Trump\", was not able to reach any Billboard charts. In 1999, the Clik was dropped from Priority Records, leaving the duo temporarily unsigned. Soon after, the Cocoa Brovaz released an underground single, \"Super Brooklyn,\" which heavily sampled the Super Mario Bros. theme. Because of the illegal use of the sample, the duo was not able to officially release the track, but the single landed them a deal with leading underground rap label Rawkus Records.\nThey appeared on a number of compilation albums over the next few years, including Soundbombing 2, Lyricist Lounge 2, Game Over and Soundbombing III and Frankie Cutlass \"Politic's & Bullshit\" Album. They were never able to release the album they recorded for Rawkus in 2002, though it has circulated as a bootleg. They rejoined Duck Down Records for the release of the Boot Camp Clik's second group album The Chosen Few in the same year. In September 2005, they returned as Smif-N-Wessun for the album Smif 'n' Wessun: Reloaded. The album received good reviews, and sold around 35,000-40,000 copies in the United States. In 2006, the Boot Camp Clik released their third group album, The Last Stand, to strong reviews and Smif-N-Wessun appeared on a special edition of Ich, the second album of the German rapper Sido. Smif-N-Wessun's fourth album, Smif-N-Wessun: The Album, was released on October 23, 2007. The album is produced by Ken Ring, Tommy Tee and more, and features appearances from Rock of Heltah Skeltah, Joell Ortiz and Norwegian supergroup the Loudmouf Choir.\nIn 2008, they participated as guests in one track on one of the most skilled Czech hip hop band PIO SQUAD on their album called Interview. There were plans for a new Smif-n-Wessun album to be released in 2009. The duo has confirmed that legendary producer Pete Rock would be producing a majority, if not all of the album. The album is entitled Monumental and was released on June 28, 2011. The album's guests include Raekwon, Bun B, Styles P, Heltah Skeltah, Top Dogg, Buckshot from Boot Camp Clik, Memphis Bleek, Freeway, Black Rob & Hurricane G.\nIn September 2013, the duo announced the release of a reggae inspired EP entitled Born and Raised entirely produced by Beatnick & K-Salaam. The EP was released on December 3, 2013 and includes guest features from Junior Reid, Jr. Kelly, Jahdan Blakkamoore, and DJ Full Factor. The EP's release was supported by one single – \"Solid Ground\" featuring Junior Reid.","strBiographyDE":null,"strBiographyFR":null,"strBiographyCN":null,"strBiographyIT":null,"strBiographyJP":null,"strBiographyRU":null,"strBiographyES":null,"strBiographyPT":null,"strBiographySE":null,"strBiographyNL":null,"strBiographyHU":null,"strBiographyNO":null,"strBiographyIL":null,"strBiographyPL":null,"strGender":"Male","intMembers":"2","strCountry":"Brooklyn, New York, USA","strCountryCode":"US","strArtistThumb":"https://www.theaudiodb.com/images/media/artist/thumb/smif-n-wessun-509352066ea77.jpg","strArtistLogo":"https://www.theaudiodb.com/images/media/artist/logo/smif-n-wessun-4fe725939b12f.png","strArtistCutout":null,"strArtistClearart":null,"strArtistWideThumb":null,"strArtistFanart":"https://www.theaudiodb.com/images/media/artist/fanart/smif-n-wessun-509351f63012c.jpg","strArtistFanart2":"https://www.theaudiodb.com/images/media/artist/fanart/smif-n-wessun-55b75556840e9.jpg","strArtistFanart3":"https://www.theaudiodb.com/images/media/artist/fanart/smif-n-wessun-53a1903594467.jpg","strArtistFanart4":null,"strArtistBanner":"https://www.theaudiodb.com/images/media/artist/banner/smif-n-wessun-55b75d58f1547.jpg","strMusicBrainzID":"6177f8df-469c-4e9d-a09f-524b29c4d849","strISNIcode":null,"strLastFMChart":null,"intCharted":"3","strLocked":"unlocked"}]}