{"artists":[{"idArtist":"116021","strArtist":"Mobb Deep","strArtistStripped":null,"strArtistAlternate":"","strLabel":null,"idLabel":null,"intFormedYear":"1993","intBornYear":null,"intDiedYear":null,"strDisbanded":null,"strStyle":"Urban/R&B","strGenre":"Rap","strMood":"","strWebsite":"","strFacebook":"","strTwitter":"1","strBiographyEN":"As golden age rap suddenly gave way to West Coast gangsta in the early '90s, an East Coast variety of hardcore rap arose in turn, with Mobb Deep initially standing tall as one of New York's hardcore figureheads on the basis of their epochal album The Infamous. Released in April 1995, The Infamous was released almost exactly a year after Illmatic and about a half year after Ready to Die -- the debut masterpieces of Nas and the Notorious B.I.G., respectively, both albums likewise of momentous significance for East Coast hardcore rap. On The Infamous, Mobb Deep (comprised of Prodigy and Havoc) set the tone for future generations of hardcore New York rappers, from G-Unit to Dipset. Subsequent releases from the duo were likewise influential, especially Hell on Earth (1996). However, by the late '90s, Mobb Deep was no longer setting trends; in fact, they seemed to be following them, and they lost some of their stature as subsequent generations of hardcore rappers arose. For a few years, Mobb Deep struggled to reclaim their commercial standing, until they eventually drifted into the G-Unit camp, where they signed a lucrative deal to join 50 Cent and company. Blood Money (2006), Mobb Deep's first release under the G-Unit banner, rekindled interest in the veteran duo, who enjoyed a substantial uptick in sales and airplay.\n\nProdigy (Albert Johnson, born November 2, 1974) and Havoc (Kejuan Muchita, born May 21, 1974) grew up in Queens, specifically the Queensbridge area, yet met in Manhattan, where both were students at Graphic Arts High School. Their shared love of hip-hop resulted in a natural companionship, and while they were still teens, the two young men had themselves a record deal with 4th & Broadway, a major rap label affiliated with Island Records. In 1993, the label released Juvenile Hell, a confrontational album featuring noteworthy production work by DJ Premier and Large Professor, who both within a year's time would move on to produce the debut of another young Queensbridge rapper, Nas. Not much came of Juvenile Hell, however, and it would be two more years before Mobb Deep would return.\n\nWhen they did return in 1995, it was on a different label, Loud Records, and with a significantly developed approach. The Infamous featured a mammoth street anthem, \"Shook Ones, Pt. 2,\" but it was a solid album all around, featuring also the in-house production work of Havoc and a couple high-profile features (Nas, Raekwon). The Infamous was more hardcore than its two key stylistic predecessors, Illmatic and Ready to Die; the beats were darker and harder-hitting while the rhymes were downright threatening yet still inventive and crafty. Moreover, there were no crossover hits like \"Big Poppa\" or \"Juicy.\" In fact, there were no light moments at all. The Infamous was an uncompromising album for the streets, and it was championed as such.\n\nA year later, in 1996, Mobb Deep returned with a follow-up, Hell on Earth, which was a little slicker than The Infamous yet still emphasized hardcore motifs. It spawned a couple hit singles that were given appropriately theatrical videos. At this point, hardcore rap was at its peak, with Death Row Records flourishing on the West Coast and a legion of New Yorkers jumping into the scene, following the lead of Nas, the Notorious B.I.G., and Mobb Deep. So when it took over two years for Mobb Deep to return with a new album, Murda Muzik, not released until April 1999, the rap landscape had changed significantly. Mobb Deep now had significant competition, and since Murda Muzik offered few innovations and lacked the spark of the duo's past two albums, it was met with some disappointment. By and large, fans enjoyed it, yet the album didn't appeal beyond the already established fan base, as the album only offered one major hit, \"Quiet Storm.\" The following year, Prodigy released a solo album, H.N.I.C. (2000). It got a lukewarm reception, appealing to the duo's fan base yet spawning no hits.\n\nWhen Mobb Deep resurfaced, in December 2001 with Infamy, they showcased a new willingness to reach beyond their fan base. \"Hey Luv\" was issued as a single, and it was the first Mobb Deep song to flirt with R&B crossover, or even to mention love, for that matter. The song got some airplay, thanks in part to its hook, which is sung by the R&B act 112, and its video, which played up the song's air of seduction. Nonetheless, Infamy proved to be a relative disappointment commercially, and it seemed like Mobb Deep was beginning to see their popularity erode with each passing year. It didn't help, either, that around this time the duo -- and Prodigy, in particular -- had been attacked by Jay-Z on \"Takeover.\" And too, that Loud Records would go out of business, leaving Mobb Deep without a label deal. For the next few years, from roughly 2002-2005, Prodigy and Havoc tried to regain their footing. There were one-off albums released via various label arrangements -- Free Agents: The Murda Mix Tape (Landspeed, 2003), Amerikaz Nightmare (Jive, 2004), and The Mix Tape Before 9/11 (X-Ray, 2004) -- that made minimal impact. By this point, not even the fan base was all that interested; it had been eroded with each passing year, leaving few faithful.\n\nThen came a surprise announcement that 50 Cent had signed Mobb Deep to his G-Unit family and that an album would be forthcoming. First came a quick remix featuring the latest G-Unit signing, \"Outta Control,\" which supplanted the original version when 50's The Massacre was reissued in 2005 as a CD/DVD. Too, Mobb Deep had become omnipresent on the New York mixtape scene, releasing all kinds of streets-only material in attempt to re-establish themselves. It evidently worked, as Blood Money debuted in the Top Ten of Billboard's album chart and brought more exposure to Mobb Deep than the duo had enjoyed since their late-'90s heyday. Not everyone was convinced by the group's makeover, however, as the G-Unit approach was substantially more polished than the Mobb Deep of The Infamous. Still, Mobb Deep found a new generation of younger listeners -- the large G-Unit market base, in particular -- who were mostly unfamiliar with them. It had been over a decade since The Infamous, after all, and Mobb Deep had been out of the spotlight for years. Then, in early 2008, Prodigy went away to prison to serve a three-year sentence, putting Mobb Deep's future in question.","strBiographyDE":null,"strBiographyFR":"Alors que l'âge d'or du rap a soudainement cédé la place aux gangsta de la côte ouest au début des années 90, une variété de rap hardcore de la côte est est apparue à son tour, Mobb Deep se tenant initialement comme l'une des figures de proue du hardcore de New York sur la base de leur album d'époque The Infamous . Sorti en avril 1995, The Infamous est sorti presque exactement un an après Illmatic et environ six mois après Ready to Die - les premiers chefs-d'œuvre de Nas et de Notorious B.I.G., respectivement, deux albums également d'une importance capitale pour le rap hardcore de la côte Est. Sur The Infamous, Mobb Deep (composé de Prodigy et Havoc) a donné le ton aux futures générations de rappeurs hardcore new-yorkais, de G-Unit à Dipset. Les versions ultérieures du duo ont également été influentes, en particulier Hell on Earth (1996). Cependant, à la fin des années 90, Mobb Deep ne définissait plus les tendances ; en fait, ils semblaient les suivre, et ils ont perdu une partie de leur stature à mesure que les générations suivantes de rappeurs hardcore surgissaient. Pendant quelques années, Mobb Deep a eu du mal à retrouver sa position commerciale, jusqu'à ce qu'il finisse par dériver dans le camp G-Unit, où il a signé un accord lucratif pour rejoindre 50 Cent et compagnie. Blood Money (2006), la première sortie de Mobb Deep sous la bannière G-Unit, a ravivé l'intérêt pour le duo de vétérans, qui a connu une augmentation substantielle des ventes et de la diffusion.\n\nProdigy (Albert Johnson, né le 2 novembre 1974) et Havoc (Kejuan Muchita, né le 21 mai 1974) ont grandi dans le Queens, en particulier dans la région de Queensbridge, mais se sont rencontrés à Manhattan, où ils étaient tous deux étudiants au Graphic Arts High School. Leur amour commun du hip-hop a abouti à une camaraderie naturelle, et alors qu'ils étaient encore adolescents, les deux jeunes hommes avaient eux-mêmes un contrat d'enregistrement avec 4th & Broadway, un label de rap majeur affilié à Island Records. En 1993, le label a sorti Juvenile Hell, un album conflictuel mettant en vedette le travail de production remarquable de DJ Premier et Large Professor, qui tous les deux dans un délai d'un an produiraient les débuts d'un autre jeune rappeur de Queensbridge, Nas. Cependant, il ne sortit pas grand-chose de Juvenile Hell, et il faudrait encore deux ans avant que Mobb Deep ne revienne.\n\nQuand ils sont revenus en 1995, c'était sur un autre label, Loud Records, et avec une approche considérablement développée. The Infamous comportait un hymne de rue mammouth, \"Shook Ones, Pt. 2\", mais c'était un album solide tout autour, mettant également en vedette le travail de production interne de Havoc et quelques longs métrages de haut niveau (Nas, Raekwon). The Infamous était plus hardcore que ses deux prédécesseurs stylistiques clés, Illmatic et Ready to Die ; les rythmes étaient plus sombres et plus percutants tandis que les rimes étaient carrément menaçantes mais toujours inventives et astucieuses. De plus, il n'y avait pas de succès croisés comme \"Big Poppa\" ou \"Juicy\". En fait, il n'y avait aucun moment de lumière du tout. The Infamous était un album sans compromis pour la rue, et il a été défendu comme tel.\n\nUn an plus tard, en 1996, Mobb Deep est revenu avec un suivi, Hell on Earth, qui était un peu plus lisse que The Infamous mais qui mettait toujours l'accent sur les motifs hardcore. Cela a engendré quelques singles à succès qui ont reçu des vidéos théâtrales appropriées. À ce stade, le rap hardcore était à son apogée, avec Death Row Records florissant sur la côte ouest et une légion de New-Yorkais se précipitant sur la scène, suivant l'exemple de Nas, du Notorious B.I.G. et de Mobb Deep. Ainsi, lorsqu'il a fallu plus de deux ans à Mobb Deep pour revenir avec un nouvel album, Murda Muzik, sorti en avril 1999, le paysage du rap avait considérablement changé. Mobb Deep avait maintenant une concurrence importante, et comme Murda Muzik offrait peu d'innovations et manquait de l'étincelle des deux derniers albums du duo, il a rencontré une certaine déception. Dans l'ensemble, les fans l'ont apprécié, mais l'album n'a pas séduit au-delà de la base de fans déjà établie, car l'album n'offrait qu'un seul succès majeur, \"Quiet Storm\". L'année suivante, Prodigy sort un album solo, H.N.I.C. (2000). Il a reçu un accueil tiède, attirant la base de fans du duo mais n'ayant engendré aucun succès.\n\nLorsque Mobb Deep a refait surface, en décembre 2001 avec Infamy, ils ont montré une nouvelle volonté d'aller au-delà de leur base de fans. \"Hey Luv\" est sorti en single, et c'était la première chanson de Mobb Deep à flirter avec le crossover R&B, ou même à mentionner l'amour, d'ailleurs. La chanson a été diffusée, en partie grâce à son crochet, qui est chanté par le R&B act 112, et sa vidéo, qui a joué l'air de séduction de la chanson. Néanmoins, Infamy s'est avéré être une déception relative sur le plan commercial, et il semblait que Mobb Deep commençait à voir sa popularité s'éroder d'année en année. Cela n'a pas aidé non plus qu'à cette époque, le duo – et Prodigy, en particulier – ait été attaqué par Jay-Z sur \"Takeover\". Et aussi, que Loud Records ferait faillite, laissant Mobb Deep sans contrat de label. Au cours des années suivantes, de 2002 à 2005 environ, Prodigy et Havoc ont tenté de reprendre pied. Il y avait des albums uniques sortis via divers arrangements de label - Free Agents: The Murda Mix Tape (Landspeed, 2003), Amerikaz Nightmare (Jive, 2004) et The Mix Tape Before 9/11 (X-Ray, 2004) - - qui a eu un impact minimal. À ce stade, même la base de fans n'était pas du tout intéressée; il s'était érodé d'année en année, laissant peu de fidèles.\n\nPuis vint une annonce surprise que 50 Cent avait signé Mobb Deep à sa famille G-Unit et qu'un album serait à venir. Tout d'abord, un remix rapide avec la dernière signature de G-Unit, \"Outta Control\", qui a supplanté la version originale lorsque 50's The Massacre a été réédité en 2005 sous forme de CD/DVD. De plus, Mobb Deep était devenu omniprésent sur la scène des mixtapes new-yorkaises, publiant toutes sortes de matériel réservé à la rue dans le but de se rétablir. Cela a évidemment fonctionné, car Blood Money a fait ses débuts dans le Top Ten du palmarès des albums de Billboard et a apporté plus de visibilité à Mobb Deep que le duo n'en avait bénéficié depuis leur apogée à la fin des années 90. Cependant, tout le monde n'a pas été convaincu par le relooking du groupe, car l'approche G-Unit était nettement plus raffinée que le Mobb Deep de The Infamous. Pourtant, Mobb Deep a trouvé une nouvelle génération d'auditeurs plus jeunes – la grande base de marché G-Unit, en particulier – qui ne les connaissaient pas pour la plupart. Cela faisait plus d'une décennie depuis The Infamous, après tout, et Mobb Deep avait été hors des projecteurs pendant des années. Puis, début 2008, Prodigy est allé en prison pour purger une peine de trois ans, mettant l'avenir de Mobb Deep en question.","strBiographyCN":null,"strBiographyIT":null,"strBiographyJP":null,"strBiographyRU":null,"strBiographyES":null,"strBiographyPT":null,"strBiographySE":null,"strBiographyNL":null,"strBiographyHU":null,"strBiographyNO":null,"strBiographyIL":null,"strBiographyPL":null,"strGender":"Male","intMembers":"2","strCountry":"Queens, NY, USA","strCountryCode":"US","strArtistThumb":"https://www.theaudiodb.com/images/media/artist/thumb/mobb-deep-509b64c951621.jpg","strArtistLogo":"https://www.theaudiodb.com/images/media/artist/logo/mobb-deep-4e4b9b7e165bb.png","strArtistCutout":null,"strArtistClearart":null,"strArtistWideThumb":null,"strArtistFanart":"https://www.theaudiodb.com/images/media/artist/fanart/mobb-deep-51266db9b647c.jpg","strArtistFanart2":"https://www.theaudiodb.com/images/media/artist/fanart/mobb-deep-508b52b20d65e.jpg","strArtistFanart3":"https://www.theaudiodb.com/images/media/artist/fanart/mobb-deep-509b64b294b7e.jpg","strArtistFanart4":"https://www.theaudiodb.com/images/media/artist/fanart/mobb-deep-55e45fbed4c6b.jpg","strArtistBanner":"https://www.theaudiodb.com/images/media/artist/banner/mobb-deep-55e468851d99a.jpg","strMusicBrainzID":"d75d1f08-bbb8-4eae-9877-399ca9121197","strISNIcode":null,"strLastFMChart":null,"intCharted":"3","strLocked":"unlocked"}]}